# Pandas merge() method : 

### The join is done on columns or indexes. If joining columns on columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on.

### Syntax ====>>>> df.merge(right,how='inner',on=None,left_on=None,right_on=None, left_index=False,right_index=False,sort=False,suffixes=('_x','_y'),copy=True, indicator=False, validate=None,)

In [2]:
import pandas as pd

In [3]:
df1 = pd.DataFrame({"ID":[1,2,3,4], "Values":["A","B","C","D"]})
df1

   ID Values
0   1      A
1   2      B
2   3      C
3   4      D

In [4]:
df2 = pd.DataFrame({"ID":[1,2,3,5], "Names":["Shubham","Shivam","Shreya","Sheethal"]})
df2

   ID     Names
0   1   Shubham
1   2    Shivam
2   3    Shreya
3   5  Sheethal

In [15]:
#Merges all rows of 1st table : "LEFT"

pd.merge(df1,df2,how="left",on="ID", indicator="TRUE")

   ID Values    Names       TRUE
0   1      A  Shubham       both
1   2      B   Shivam       both
2   3      C   Shreya       both
3   4      D      NaN  left_only

In [14]:
#Merges all rows of 2st table : "RIGHT"

pd.merge(df1,df2,how="right",on="ID", indicator="TRUE")

   ID Values     Names        TRUE
0   1      A   Shubham        both
1   2      B    Shivam        both
2   3      C    Shreya        both
3   5    NaN  Sheethal  right_only

In [13]:
#Getting only the intersection values : "INNER"

pd.merge(df1,df2,how="inner",on="ID", indicator="TRUE")

   ID Values    Names  TRUE
0   1      A  Shubham  both
1   2      B   Shivam  both
2   3      C   Shreya  both

In [12]:
#Getting all the values from both the tables : "OUTER"

pd.merge(df1,df2,how="outer",on="ID", indicator="TRUE")

   ID Values     Names        TRUE
0   1      A   Shubham        both
1   2      B    Shivam        both
2   3      C    Shreya        both
3   4      D       NaN   left_only
4   5    NaN  Sheethal  right_only